src/Catalogs/НеиденитифицированныеПредметыСнабжения/НеиденитифицированныеПредметыСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НеиденитифицированныеПредметыСнабжения</name>
  <attributes>
    <name>Обозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НеиденитифицированныеПредметыСнабжения/ManagerModule.bsl
/////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НайтиПоОбозначению(Обозначение) Экспорт 
	Результат 		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	НеиденитифицированныеПредметыСнабжения.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Справочник.НеиденитифицированныеПредметыСнабжения КАК НеиденитифицированныеПредметыСнабжения
	             	  |ГДЕ
	             	  |	НЕ НеиденитифицированныеПредметыСнабжения.ПометкаУдаления
	             	  |	И НеиденитифицированныеПредметыСнабжения.ОбозначениеДляПоиска = &ОбозначениеДляПоиска";
	Запрос.УстановитьПараметр("ОбозначениеДляПоиска", ВРег(СокрЛП(Обозначение)));
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Ссылка;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	Возврат Результат;
КонецФункции // НайтиПоОбозначению

Функция Создать(Наименование, Обозначение) Экспорт
	Элемент 				= Справочники.НеиденитифицированныеПредметыСнабжения.СоздатьЭлемент();
	Элемент.Наименование 	= Наименование;
	Элемент.Обозначение 	= Обозначение;
	Элемент.Записать();
	Возврат Элемент.Ссылка;
КонецФункции // Создать
